In [20]:
import pandas as pd
import calendar

In [11]:
data=pd.read_csv('crime_clean.csv',index_col=0)
data.head()

,TYPE,YEAR,MONTH,DAY,HOUR,MINUTE,HUNDRED_BLOCK,NEIGHBOURHOOD,X,Y,Latitude,Longitude,DATE
0,Other Theft,2003,5,12,16.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-05-12
1,Other Theft,2003,5,7,15.0,20.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-05-07
2,Other Theft,2003,4,23,16.0,40.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-23
3,Other Theft,2003,4,20,11.0,15.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-20
4,Other Theft,2003,4,12,17.0,45.0,9XX TERMINAL AVE,Strathcona,493906.5,5457452.47,49.269802,-123.083763,2003-04-12

In [16]:
date_df=data[['DATE']]
date_df=date_df.drop_duplicates()
date_df['DATE']=pd.to_datetime(date_df['DATE']).astype('datetime64[ns]')
date_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5308 entries, 0 to 514245
Data columns (total 1 columns):
DATE    5308 non-null datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 82.9 KB

In [17]:
date_df.head()

        DATE
0 2003-05-12
1 2003-05-07
2 2003-04-23
3 2003-04-20
4 2003-04-12

In [18]:
date_df['day_of_week'] = date_df['DATE'].dt.day_name()
date_df.head()

        DATE day_of_week
0 2003-05-12      Monday
1 2003-05-07   Wednesday
2 2003-04-23   Wednesday
3 2003-04-20      Sunday
4 2003-04-12    Saturday

In [24]:
date_df['Month'] = data['MONTH'].apply(lambda x: calendar.month_name[x])

In [25]:
date_df.head()

        DATE day_of_week  Month
0 2003-05-12      Monday    May
1 2003-05-07   Wednesday    May
2 2003-04-23   Wednesday  April
3 2003-04-20      Sunday  April
4 2003-04-12    Saturday  April

In [26]:
date_df.to_csv("days_of_week.csv")